//---------------------------------------------------
//一般習慣寫的jQuery程式碼，從「(function($){」開始
(function($){
	//***************************************************
	// 語法:$(document).ready(function() {});
	// 在網頁文件載入後會觸發這個函數
	$(document).ready(function() 
	{
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		// 導航欄，navigation類別。
		//		
		jQuery(".nav-toggle-button").click(function(event) 
		{
			$("body .navigation .nav").slideToggle()			
		});	
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	});
	//***************************************************	
})(jQuery);
//一般習慣寫的jQuery程式碼，到「})(jQuery);」結束。
//---------------------------------------------------
